In [1]:
import configparser
import psycopg2

In [2]:
config = configparser.ConfigParser()
config.read('dwh.cfg')
conn = psycopg2.connect("host={} dbname={} user={} password={} port={}".format(*config['CLUSTER'].values()))
cur = conn.cursor()

In [5]:
from sqlalchemy import create_engine
import pandas as pd
engine = create_engine('postgresql://username:password@sparkifycluster.cozg2c5ifwbn.us-west-2.redshift.amazonaws.com:5439/sparkify')
staging_songs = pd.read_sql('SELECT * FROM staging_songs',engine)

In [6]:
staging_songs.head()

,num_songs,artist_id,artist_latitude,artist_longitude,artist_location,artist_name,song_id,title,duration,year
0,1,AR5AA4Q1187FB4CFBD,NaN,NaN,,Alisha's Attic,SOPOQFU12A6D4F8C5F,Sex Is On Everyone's Tongue,198.55628,2001
1,1,ARUWLCL1187FB549B8,NaN,NaN,,Yamandu Costa,SOFGHAM12AB0186412,Mafuá,190.04036,0
2,1,AR1F6T91187FB4D5FE,53.74319,-0.34592,"Hull, England",Baby Mammoth,SOJJLFV12A8C146ACC,Tolstoy,237.50485,1997
3,1,ARV1P811187FB3CFC6,NaN,NaN,,Jupiter Rising,SOGMXBW12A6D4FB8D7,They Say (Album),193.46240,2007
4,1,AR54HGU1187FB5ACDE,NaN,NaN,,Girugämesh,SOENOSR12A8C13A90E,freesia,262.58240,2007

In [7]:
staging_events = pd.read_sql('SELECT * FROM staging_events',engine)
staging_events.head()

,artist,auth,firstname,gender,iteminsession,lastname,length,level,location,method,page,registration,sessionid,song,status,ts,useragent,userid
0,A Fine Frenzy,Logged In,Anabelle,F,0,Simpson,267.91138,free,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD",PUT,NextSong,1.541044e+12,256,Almost Lover (Album Version),200,2018-11-05 00:33:12.796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",69.0
1,Nirvana,Logged In,Aleena,F,0,Kirby,214.77832,paid,"Waterloo-Cedar Falls, IA",PUT,NextSong,1.541023e+12,237,Serve The Servants,200,2018-11-05 01:27:22.796,Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; r...,44.0
2,Television,Logged In,Aleena,F,1,Kirby,238.49751,paid,"Waterloo-Cedar Falls, IA",PUT,NextSong,1.541023e+12,237,See No Evil (Remastered LP Version),200,2018-11-05 01:30:56.796,Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; r...,44.0
3,JOHN COLTRANE,Logged In,Aleena,F,2,Kirby,346.43546,paid,"Waterloo-Cedar Falls, IA",PUT,NextSong,1.541023e+12,237,Blues To Bechet (LP Version),200,2018-11-05 01:34:54.796,Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; r...,44.0
4,NOFX,Logged In,Aleena,F,3,Kirby,80.79628,paid,"Waterloo-Cedar Falls, IA",PUT,NextSong,1.541023e+12,237,It's My Job To Keep Punk Rock Elite,200,2018-11-05 01:40:40.796,Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; r...,44.0

# Fact Table

In [9]:
songplays = pd.read_sql('SELECT * FROM songplays',engine)
songplays.head()

,songplay_id,start_time,user_id,level,song_id,artist_id,session_id,location,user_agent
0,55,2018-11-05 05:57:05.796,57,free,SOCGOZK12A8151BD5D,ARM0P6Z1187FB4D466,56,"San Antonio-New Braunfels, TX","""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_6_8..."
1,200,2018-11-05 15:43:22.796,97,paid,SODHZVG12A8C1404DD,ARS5WKC1187B9AC7D1,147,"Lansing-East Lansing, MI","""Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/5..."
2,30,2018-11-05 17:31:40.796,35,free,SONTFNG12A8C13FF69,AR52EZT1187B9900BF,171,"St. Louis, MO-IL","""Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/5..."
3,360,2018-11-08 14:27:08.796,81,free,SOQDMXT12A6D4F8255,ART5MUE1187B98C961,317,"Las Cruces, NM","""Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebK..."
4,176,2018-11-09 19:57:57.796,36,paid,SODWXQV12A6310F10D,AR6892W1187B9AC71B,392,"Janesville-Beloit, WI","""Mozilla/5.0 (Windows NT 5.1) AppleWebKit/537...."

# Dim Tables

In [10]:
users = pd.read_sql('SELECT * FROM users',engine)
users.head()

   user_id first_name last_name gender level
0       12     Austin   Rosales      M  free
1       20      Aiden   Ramirez      M  paid
2       35      Molly    Taylor      F  free
3       37     Jordan     Hicks      F  free
4       38     Gianna     Jones      F  free

In [11]:
songs = pd.read_sql('SELECT * FROM songs',engine)
songs.head()

,song_id,title,artist_id,year,duration
0,SOAAHZO12A67AE1265,Agni Sha Kshi,AR9DE5T1187FB48CA3,0,229.69424
1,SOAASHY12A58A7C439,Ricordo,AR0VQ8W1187FB4F4D9,2003,275.98322
2,SOAAUGN12AB01830B6,Don't Wanna Suffer (Carbon Copy),ARVC9W21187B99354B,2003,180.63628
3,SOAAUVF12A58A7D58C,Hickory Wind (Remastered LP Version),AR9VCSR1187B9B879E,1979,243.48689
4,SOAAXEV12A6D4FA21C,Micro Chip,ARTRZBZ1187FB5698A,2006,230.71302

In [12]:
artists = pd.read_sql('SELECT * FROM artists',engine)
artists.head()

,artist_id,name,location,latitude,longitude
0,AR00TGQ1187B994F29,Paula Toller,,NaN,NaN
1,AR02T3I1187FB4D0E5,Aberfeldy,"Edinburgh, Scotland",NaN,NaN
2,AR039B11187B9B30D0,John Williams,"NEW YORK, New York",NaN,NaN
3,AR03IZC1187FB3E058,Aidonia,,NaN,NaN
4,AR04S8J1187FB48358,Clifford Brown / Max Roach Quintet,"Wilmington, DE",39.74023,-75.55084

In [13]:
time = pd.read_sql('SELECT * FROM time',engine)
time.head()

               start_time  hour  day  week  month  year weekday
0 2018-11-05 05:57:05.796     5    5    45     11  2018       1
1 2018-11-05 15:43:22.796    15    5    45     11  2018       1
2 2018-11-05 17:31:40.796    17    5    45     11  2018       1
3 2018-11-08 14:27:08.796    14    8    45     11  2018       4
4 2018-11-09 19:57:57.796    19    9    45     11  2018       5